Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་ཡོན་ཏན་དང་ལྡན་པའོ།
en: Subhūti, irreversible bodhisattva great beings are endowed with incalculable and inestimable attributes.

source: །རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསྐྱོད་དུ་མེད་པའི་ཡོན་ཏན་དང་ལྡན་པའོ།
en: Subhūti, irreversible bodhisattva great beings are endowed with unshakeable attributes.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པའི་ཡེ་ཤེས་མཐའ་ཡས་མུ་མེད་པ་རབ་ཏུ་ཐོབ་སྟེ།
en: If you ask why, it is because they have acquired the infinite and limitless wisdom that is not shared in common with any śrāvakas or pratyekabuddhas.

source: ཡེ་ཤེས་དེ་ལ་གནས་ཤིང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་མངོན་པར་བསྒྲུབས་པ། གང་གིས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་དྲིས་ཀྱང་ལན་ཟད་པར་མི་འགྱུར་བའི་སོ་སོ་ཡང་དག་པར་རིག་པ་མངོན་པར་སྒྲུབ་པོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Abiding in this wisdom, irreversible bodhisattva great beings have actualized the kinds of exact knowledge—the kinds of exact knowledge in consequence of which they cannot succumb to any response, even when questioned by the world with its gods, humans, and asuras.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ནི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་ཡང་རྣམ་པ་གང་དང་། ཚུལ་གང་དང་། མཚན་མ་གང་གིས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོར་བརྗོད་པའི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པ་དང་། ཚུལ་དང་མཚན་མ་རྣམས་སྟོན་པའི་མཐུ་མངའ་ན། བཅོམ་ལྡན་འདས་གང་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Subhūti then requested, “Blessed Lord, since the tathāgatas, arhats, completely awakened buddhas have the power to reveal, over eons numerous as the grains of sand of the river Gaṅgā, the attributes, indications, and signs on account of which irreversible bodhisattva great beings are called irreversible bodhisattva great beings, Blessed Lord, please reveal the profound states in which bodhisattva great beings, when practicing the six perfections, complete the four applications of mindfulness; in which they complete the correct exertions, the supports for miraculous ability, {Ki.

source: སྨོན་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: IV: 164} the faculties, the powers, the branches of enlightenment, and the noble eightfold path; in which they complete the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; in which they complete the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness; in which they complete the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; in which they complete the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas; and in which they complete [all the goals], up to and including all-aspect omniscience.” “

source: བྱམས་པ་ཆེན་པོ་དང་།
en: Excellent, Subhūti!

source: སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པའི་གནས་ཟབ་མོ་ཟབ་མོ་རྣམས་ལེགས་པར་བསྟན་དུ་གསོལ།
en: Excellent!”

source: རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ། །རབ་འབྱོར་ཁྱོད་དེ་ལྟར་ཁྱོད་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་ལ་གནས་ཟབ་མོ་རྣམས་དྲི་བར་སེམས་པ་ལེགས་སོ།
en: Subhūti, it is excellent that you are thinking to ask the Tathāgata about those profound states, for the sake of irreversible bodhisattva great beings.

source: །རབ་འབྱོར་ཟབ་མོ་ཞེས་བྱ་བ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ།
en: Subhūti, this term profound is a designation of emptiness.

source: །འདི་ནི་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། འགོག་པ་དང་།
en: This is a designation of signlessness, wishlessness, nonconditioning, nonarising, nonattachment, noncessation, nirvāṇa, quiescence, real nature, the very limit of reality, and the realm of phenomena.

source: མྱ་ངན་ལས་འདས་པ་དང་། ཞི་བ་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚིག་བླ་དགས་སོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་གང་མྱ་ངན་ལས་འདས་པའི་ཚིག་བླ་དགས་དེ་དག་ནི་གནས་ཟབ་མོ་ཟབ་མོ་ཞེས་བྱ་བ་དེ་དག་གོ།
en: Subhūti, these designations of nirvāṇa are said to be profound states.” “

source: །གསོལ་པ། དེ་མྱ་ངན་ལས་འདས་པའི་ཚིག་བླ་དགས་སུ་བས་ཀྱི། ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་བླ་དགས་མ་ལགས་སམ།
en: Is it a designation of nirvāṇa but not of all phenomena?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཟབ་མོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་བླ་དགས་ཀྱང་དེ་ཡིན་ནོ།
en: Subhūti,” replied the Blessed One, “the term profound is indeed a designation of all phenomena.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གཟུགས་ཟབ་བོ།
en: If you ask why, Subhūti, physical forms are profound.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཟབ་བོ།
en: Feelings, perceptions, formative predispositions, and consciousness are profound.

source: །རབ་འབྱོར་མི་ག་ཟབ་བོ།
en: Subhūti, the eyes are profound.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཟབ་བོ། །རབ་འབྱོར་གཟུགས་ཟབ་བོ།
en: The ears, nose, tongue, body, and mental faculty are profound. Subhūti, sights are profound.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ཟབ་བོ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are profound.

source: །རབ་འབྱོར་མིག་གི་རྣམ་པར་ཤེས་པ་ཟབ་བོ།
en: Subhūti, visual consciousness is profound.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཟབ་བོ།
en: Visually compounded sensory contact and feelings conditioned by visually compounded sensory contact are profound.

source: །རབ་འབྱོར་རྣ་བ་དང་། སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཟབ་བོ། །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་དང་།
en: Subhūti, auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are profound.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཟབ་བོ།
en: Mentally compounded sensory contact [and so forth], and feelings conditioned by mentally compounded sensory contact [and so forth], are profound.

source: །རབ་འབྱོར་སའི་ཁམས་ཟབ་བོ།
en: Subhūti, the earth element is profound.

source: །ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་།
en: The water element, the fire element, the wind element, the space element, and the consciousness element are profound.

source: རྣམ་པར་ཤེས་པའི་ཁམས་ཟབ་བོ། །རབ་འབྱོར་མ་རིག་པ་ཟབ་བོ། །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་ཟབ་བོ།
en: Subhūti, ignorance, formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are profound.

source: །རབ་འབྱོར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཟབ་བོ།
en: Subhūti, all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are profound.

source: །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ཟབ་བོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, {Ki.IV: 165} the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are profound.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཟབ་བོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are profound.

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཟབ་བོ།
en: Subhūti, [the goals], up to and including all-aspect omniscience, are profound.

source: །བྱང་ཆུབ་ཟབ་པོ་རབ་འབྱོར་ཇི་ལྟར་ན་གཟུགས་ཟབ།
en: Enlightenment is profound. “

source: ཇི་ལྟར་ན་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཟབ། ཇི་ལྟར་ན་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ། ཇི་ལྟར་ན་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཟབ། ཇི་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་ཟབ།
en: Subhūti, if you ask how physical forms are profound; how feelings, perceptions, formative predispositions, and consciousness are profound; how the sense fields, the sensory elements, and the links of dependent origination are profound; how all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are profound; how [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are profound; how [the goals], up to and including all-aspect omniscience, are profound; and how enlightenment is profound, physical forms are as profound as the real nature of physical forms.

source: ཇི་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཟབ། ཇི་ལྟར་ན་བྱང་ཆུབ་ཟབ་ཅེ་ན། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཟུགས་ཟབ་བོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པ་ཟབ་བོ།
en: Feelings, perceptions, formative predispositions, and consciousness are as profound as the real nature of consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་བོ།
en: The sense fields, sensory elements, and links of dependent origination are as profound as the real nature of the links of dependent origination [and so forth].

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཟབ་བོ།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are as profound as the real nature of the thirty-seven factors conducive to enlightenment [and so forth].

source: །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་རྣམ་པར་ཐར་པ་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཟུངས་ཀྱི་སྒོ་རྣམས་ཟབ་བོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are as profound as the real nature of the dhāraṇī gateways [and so forth].

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཟབ་བོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are as profound as the real nature of the distinct qualities of the buddhas [and so forth]. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཟབ་བོ།
en: The goals], up to and including all-aspect omniscience, are as profound as the real nature of all-aspect omniscience [and so forth].

source: །བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་ཟབ་བོ།
en: Enlightenment is as profound as the real nature of enlightenment.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of physical forms?

source: བཅོམ་ལྡན་འདས་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of feelings, perceptions, formative predispositions, and consciousness?

source: བཅོམ་ལྡན་འདས་སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of the sense fields, sensory elements, and links of dependent origination?

source: བཅོམ་ལྡན་འདས་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment?

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas?

source: བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of [the goals], up to and including all-aspect omniscience?

source: བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, how is the real nature of enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དེ་ལ་གཟུགས་ཀྱང་མེད། གཟུགས་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: Subhūti,” replied the Blessed One, “in the real nature of physical forms there are indeed no physical forms, nor is there any real nature other than physical forms—such is the real nature of physical forms.

source: །རབ་འབྱོར་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་རྣམ་པར་ཤེས་པ་ཡང་མེད། རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: Subhūti, in the real nature of feelings, perceptions, formative predispositions, and consciousness there is indeed no consciousness [and so forth], nor is there any real nature other than consciousness [and so forth]—such is the real nature of consciousness [and so forth].

source: །རབ་འབྱོར་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་དེ་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡང་མེད། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: Subhūti, in the real nature of the sense fields, sensory elements, and links of dependent origination there are indeed no links of dependent origination [and so forth], nor is there any real nature other than the links of dependent origination [and so forth]—such is the real nature of the links of dependent origination [and so forth].

source: །རབ་འབྱོར་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དེ་ལ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱང་མེད། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: Subhūti, in the real nature of all the perfections, all the aspects of emptiness, and the factors conducive to enlightenment there are indeed no factors conducive to enlightenment [and so forth], nor is there any real nature other than the factors conducive to enlightenment [and so forth]—such is the real nature of the factors conducive to enlightenment [and so forth].

source: །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་དེ་བཞིན་ཉིད་དེ་ལ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཡང་མེད་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: In the real nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions, there are indeed no formless absorptions [and so forth], nor is there any real nature other than the formless absorptions [and so forth]—such is the real nature of the formless absorptions [and so forth].

source: །རྣམ་པར་ཐར་པ་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་དེ་བཞིན་ཉིད་དེ་ལ། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་ཡང་མེད། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: In the real nature of the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness, there is indeed no emptiness, signlessness, and wishlessness [and so forth], nor is there any real nature other than emptiness, signlessness, and wishlessness [and so forth]—such is the real nature of emptiness, signlessness, and wishlessness [and so forth].

source: །མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་མེད། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: In the real nature of the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas, there are indeed no distinct qualities of the buddhas [and so forth], nor is there any real nature other than the distinct qualities of the buddhas [and so forth]— such is the real nature of the distinct qualities of the buddhas [and so forth].

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་དེ་ལ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མེད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ནི་ད་ལྟ་བུའོ།
en: Subhūti, in the real nature of [the goals], up to and including all-aspect omniscience, there is indeed no all-aspect omniscience [and so forth], nor is there any real nature other than all-aspect omniscience [and so forth]—such is the real nature of all-aspect omniscience [and so forth].

source: །རབ་འབྱོར་བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་དེ་ལ་བྱང་ཆུབ་ཀྱང་མེད་བྱང་ཆུབ་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ་བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ།
en: Subhūti, in the real nature of enlightenment, there is indeed no enlightenment, nor is there any real nature other than enlightenment—such is the real nature of enlightenment.” {Ki.

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ལྟར་ཐབས་ཕྲ་བས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ལས་ཀྱང་བཟློག །མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན།
en: IV: 166} “Blessed Lord, how wonderful it is that by such a subtle method irreversible bodhisattva great beings have indeed turned away from physical forms, and have also pointed toward nirvāṇa!

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལས་ཀྱང་བཟློག །མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན།
en: They have indeed turned away from feelings, perceptions, formative predispositions, and consciousness, and have also pointed toward nirvāṇa!

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལས་ཀྱང་བཟློག་མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན།
en: They have indeed turned away from the sense fields, sensory elements, and links of dependent origination, and have also pointed toward nirvāṇa!

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་སྟོང་པ་ཉིད་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལས་ཀྱང་བཟློག །མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན།
en: They have indeed turned away from all the perfections, all the aspects of emptiness, and the factors conducive to enlightenment, and have also pointed toward nirvāṇa!

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལས་ཀྱང་བཟློག །མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན།
en: They have indeed turned away from [the fruitional attributes], up to and including the distinct qualities of the buddhas, and have also pointed toward nirvāṇa!

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པ་དང་། ཐུན་མོང་དང་ཐུན་མོང་མ་ལགས་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མ་མཆིས་པའི་འཛིན་པ་ཐམས་ཅད་ལས་ཀྱང་བཟློག །མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན་པ་དེ་ནི་ངོ་མཚར་ཆེའོ།
en: They have indeed turned away from all grasping for phenomena that are mundane, supramundane, common, uncommon, contaminated, and uncontaminated, and have also pointed toward nirvāṇa!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་བདག་གིས་གནས་པར་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཇི་སྐད་བརྗོད་པ་བཞིན་དུ་བདག་གིས་བསླབ་པར་བྱའོ་ཞེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་གནས་ཟབ་མོ་འདི་དག་སེམས་ཤིང་འཇལ་བ་དང་།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings should themselves dwell in accordance with the teachings as they are revealed in the perfection of wisdom.

source: རྟོག་པ་བྱེད་ན་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཇི་སྐད་བཤད་པ་དེ་བཞིན་དུ་སྒྲུབ་པ་དང་། དེ་བཞིན་དུ་སེམས་པ་དང་། དེ་བཞིན་དུ་ཡོངས་སུ་རྟོག་པ་དང་དེ་བཞིན་དུ་བརྩོན་པར་བྱེད་པ་དང་། དེ་བཞིན་དུ་རྩོལ་བ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཇི་སྐད་དུ་བསྟན་པ་དེ་བཞིན་དུ་འབད་པ་དེ་ནི། སེམས་བསྐྱེད་པ་གཅིག་གིས་ཀྱང་གྲངས་མེད་ཚད་མེད་དཔག་ཏུ་མེད་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཏེ།
en: If, with regard to these profound states associated with the perfection of wisdom, they think, evaluate, and reflect that they themselves should train in accordance with the teachings as they are revealed in the perfection of wisdom, then, Subhūti, those bodhisattva great beings who practice, reflect, investigate, persevere, and make efforts in accordance with the teachings as they are revealed in the perfection of wisdom, and who strive in accordance with the teachings as they are revealed in the perfection of wisdom, will acquire through a single setting of the mind on enlightenment roots of virtuous action that are incalculable, immeasurable, and inestimable.

source: དེ་བསྐལ་པ་ཚད་མེད་པར་འཁོར་བ་སྤོང་བར་འགྱུར་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མ་འདྲེས་པར་སྤྱོད་ཅིང་། བྱང་ཆུབ་ཡིད་ལ་བྱ་བ་དང་ལྡན་པར་གནས་པ་ལྟ་ཅི་སྨོས། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If they can spurn cyclic existence for immeasurable eons, it goes without saying that they will practice the perfection of wisdom without adulteration and maintain the directing of their mind toward enlightenment. “

source: སྐྱེས་བུ་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཅན་རྟོག་པ་དང་ལྡན་པ་ལ་ལ་ཞིག་གིས་བུད་མེད་གཟུགས་བཟང་ཞིང་མཛེས་པ་ལྟ་ན་སྡུག་པ་ཞིག་བཏུས་ལ། བུད་མེད་དེ་གཞན་གྱིས་ཡོངས་སུ་བཟུང་བ་ཞིག་སྟེ། ཁྱིམ་ནས་ཕྱིར་འབྱུང་བར་ཡང་མ་ནུས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྐྱེས་བུ་དེའི་རྟོག་པ་ཅི་དང་ལྡན་པར་འགྱུར་གསོལ་པ།
en: Subhūti, just as if a man with thoughts that are preoccupied with desire might have arranged to meet up with an attractive, beautiful, and good-looking woman, but that woman is restrained by another and unable to leave the house, with what, do you think, Subhūti, would the thoughts of that man be concerned?” “

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དེའི་རྟོག་པ་ནི་བུད་མེད་དང་ལྡན་པར་འགྱུར་ཏེ།
en: Blessed Lord, the thoughts of that man would be concerned with the woman.

source: བདག་གི་བུད་མེད་ནི་འདི་ལྟ་བུ་ཞིག་གོ།
en: He would think, ‘My woman is such and such!

source: །དེ་འོངས་ནས་དེ་དང་། ལྷན་ཅིག་ཏུ་གནས་པར་བྱའོ། །རྩེ་བར་བྱའོ་སྙམ་མོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: She should come and then I would stay with her and sport with her!’ ” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཉིན་མཚན་འདས་པས་སྐྱེས་བུ་དེའི་རྟོག་པ་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར།
en: Subhūti, how many such thoughts will that man have over a day or night?”
